Documents/АР_ПланированиеЗатратНаЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>АР_ПланированиеЗатратНаЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПланируемыеЗатратыНаОбслуживаниеОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплексРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплексРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АР_ПараметрыЭксплуатацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>АР_ПараметрыЭксплуатацииОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехнологическаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ТехнологическиеКартыТехОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбслуживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыОбслуживанияОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГрафикиОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ПоказателиВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПороговоеЗначениеВыработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ЭлементыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомплексРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/АР_ТехнологическиеКартыТехОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АР_ТехнологическиеКартыТехОбслуживания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ТехнологическиеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутренняяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/АР_ПланированиеЗатратНаЭксплуатацию/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура предназначена для автоматического заполнения списка работ по данным технологических карт
Процедура ЗаполнитьРаботы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.Организация,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ОбъектАренды,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ЭлементОбъекта,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.КомплексРабот,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.Спецификация,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТипОбслуживания,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ГрафикОбслуживания,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ПоказательВыработки,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ПороговоеЗначениеВыработки,
	|	АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТехнологическаяКарта,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Операция КАК ТехОперация,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.ВремяВыполнения,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Количество,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Работа,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.ВнутренняяРабота,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Операция.Расценка КАК Цена,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Операция.Расценка * АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Количество КАК Сумма,
	|	АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Операция.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.АР_ПараметрыЭксплуатацииОбъектов.СрезПоследних(&МоментВремени, Организация = &Организация) КАК АР_ПараметрыЭксплуатацииОбъектовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ТехнологическиеКартыТехОбслуживания.Маршрут КАК АР_ТехнологическиеКартыТехОбслуживанияМаршрут
	|		ПО АР_ПараметрыЭксплуатацииОбъектовСрезПоследних.ТехнологическаяКарта = АР_ТехнологическиеКартыТехОбслуживанияМаршрут.Ссылка";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	//определим, сколько раз необходимо выполнить комплексные работы по каждому графику в заданном периоде
	ТаблицаГрафиков =ПроверитьТребованиеВыполненияРаботПоГрафикамОбслуживания(РезультатЗапроса);
			
	//теперь пройдемся по всем объектам и их элементам	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Для каждого дня из периода планирования затрат необходимо получить подтверждение необходимости выполнения
		// операций по обслуживанию.
		СтрокаГрафика = ТаблицаГрафиков.Найти(Выборка.ГрафикОбслуживания,"ГрафикОбслуживания");
		КоличествоКомплексныхРабот = СтрокаГрафика.КоличествоКомплексныхРабот;
		
		Если КоличествоКомплексныхРабот <> 0 Тогда
			//добавляем работу в табличную часть
			СтрокаТЧ = Работы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
			СтрокаТЧ.Количество = СтрокаТЧ.Количество*КоличествоКомплексныхРабот;
			СтрокаТЧ.Сумма = СтрокаТЧ.Количество*СтрокаТЧ.Цена;
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры

// Процедура предназначена для автоматического заполнения списка работ по данным спецификаций
Процедура ЗаполнитьМатериалы() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	Материалы.Номенклатура,
	 |	Материалы.Количество,
	 |	Материалы.КомплексРабот,
	 |	Материалы.ГрафикОбслуживания,
	 |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	 |	Материалы.ОбъектАренды,
	 |	Материалы.ЭлементОбъекта,
	 |	Материалы.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура КАК Номенклатура,
	 |		СУММА(СпецификацииНоменклатурыИсходныеКомплектующие.Количество) КАК Количество,
	 |		ВложенныйЗапрос.КомплексРабот КАК КомплексРабот,
	 |		ВложенныйЗапрос.ГрафикОбслуживания КАК ГрафикОбслуживания,
	 |		ВложенныйЗапрос.ОбъектАренды КАК ОбъектАренды,
	 |		ВложенныйЗапрос.ЭлементОбъекта КАК ЭлементОбъекта
	 |	ИЗ
	 |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |			ПараметрыЭксплуатации.ОбъектАренды КАК ОбъектАренды,
	 |			ПараметрыЭксплуатации.ЭлементОбъекта КАК ЭлементОбъекта,
	 |			ПараметрыЭксплуатации.КомплексРабот КАК КомплексРабот,
	 |			ПараметрыЭксплуатации.Спецификация КАК Спецификация,
	 |			ПараметрыЭксплуатации.ГрафикОбслуживания КАК ГрафикОбслуживания,
	 |			ПараметрыЭксплуатации.ТехнологическаяКарта КАК ТехнологическаяКарта
	 |		ИЗ
	 |			РегистрСведений.АР_ПараметрыЭксплуатацииОбъектов.СрезПоследних(&МоментВремени, Организация = &Организация) КАК ПараметрыЭксплуатации) КАК ВложенныйЗапрос
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
	 |			ПО ВложенныйЗапрос.Спецификация = СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ВложенныйЗапрос.КомплексРабот,
	 |		СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура,
	 |		ВложенныйЗапрос.ГрафикОбслуживания,
	 |		ВложенныйЗапрос.ОбъектАренды,
	 |		ВложенныйЗапрос.ЭлементОбъекта) КАК Материалы
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&МоментВремени, ТипЦен = &ПлановыеЦены) КАК ЦеныНоменклатурыСрезПоследних
	 |		ПО Материалы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	 
 	Запрос.УстановитьПараметр("МоментВремени",МоментВремени());
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ПлановыеЦены", Константы.АР_ТипЦенПлановойСебестоимостиМатериалов.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//определим, сколько раз необходимо выполнить комплексные работы по каждому графику в заданном периоде
	ТаблицаГрафиков = ПроверитьТребованиеВыполненияРаботПоГрафикамОбслуживания(РезультатЗапроса);
			
	//теперь пройдемся по всем объектам и их элементам	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Для каждого дня из периода планирования затрат необходимо получить подтверждение необходимости
		// выполнения операций по обслуживанию.
		СтрокаГрафика = ТаблицаГрафиков.Найти(Выборка.ГрафикОбслуживания,"ГрафикОбслуживания");
		КоличествоКомплексныхРабот = СтрокаГрафика.КоличествоКомплексныхРабот;
		
		Если КоличествоКомплексныхРабот <> 0 Тогда
			//добавляем работу в табличную часть
			СтрокаТЧ = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Количество = СтрокаТЧ.Количество * КоличествоКомплексныхРабот;
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
				Сообщить("В строке " + СтрокаТЧ.НомерСтроки + ": Для материала """ + Выборка.Номенклатура + """ не назначена плановая цена себестоимости!");
			Иначе
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
  	
КонецПроцедуры

Функция ПроверитьТребованиеВыполненияРаботПоГрафикамОбслуживания(РезультатЗапроса)
	
	//определим, сколько раз необходимо выполнить комплексные работы по каждому графику в заданном периоде
	ТаблицаГрафиков = РезультатЗапроса.Выгрузить();
	ТаблицаГрафиков.Свернуть("ГрафикОбслуживания, КомплексРабот, ОбъектАренды, ЭлементОбъекта");
	Для Каждого Стр Из ТаблицаГрафиков Цикл
		Расписание = Стр.ГрафикОбслуживания.Расписание.Получить();
		Если ТипЗнч(Расписание)<>Тип("РасписаниеРегламентногоЗадания") Тогда
			ТекстСообщения = СтрШаблон("Не указан график обслуживания для комплекса работ ""%1"" по объекту ""%2""", Стр.КомплексРабот, Стр.ОбъектАренды)
				+ ?(ЗначениеЗаполнено(Стр.ЭлементОбъекта), СтрШаблон(" (элемент ""%1"")", Стр.ЭлементОбъекта), "");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаГрафиков.Свернуть("ГрафикОбслуживания");
	ТаблицаГрафиков.Колонки.Добавить("КоличествоКомплексныхРабот");
	
	МассивДат = СформироватьМассивДат(НачалоПериода,ОкончаниеПериода);
	
	Для Каждого Стр Из ТаблицаГрафиков Цикл
		ПоследняяДатаВыполнения = Дата(1,1,1);
		КоличествоКомплексныхРабот = 0;
		Стр.КоличествоКомплексныхРабот = 0;
		
		// Для каждого дня из периода планирования затрат необходимо получить подтверждение необходимости
		// выполнения операций по обслуживанию.
		Расписание = Стр.ГрафикОбслуживания.Расписание.Получить();
		Если ТипЗнч(Расписание)<>Тип("РасписаниеРегламентногоЗадания") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого День Из МассивДат Цикл
			ТребуетсяВыполнение = Расписание.ТребуетсяВыполнение(День,ПоследняяДатаВыполнения,);
			Если ТребуетсяВыполнение Тогда
				КоличествоКомплексныхРабот = КоличествоКомплексныхРабот+1;
				ПоследняяДатаВыполнения = День;
			КонецЕсли;
		КонецЦикла;
		
		Стр.КоличествоКомплексныхРабот = КоличествоКомплексныхРабот;
	КонецЦикла;
	
	Возврат ТаблицаГрафиков;

КонецФункции

Функция СформироватьМассивДат(НачалоПериода, ОкончаниеПериода)
	
	День = 60*60*24;
	МассивДат = Новый Массив();
	ОчереднаяДата = НачалоДня(НачалоПериода);
	
	Пока ОчереднаяДата<=ОкончаниеПериода Цикл
		МассивДат.Добавить(ОчереднаяДата);
		ОчереднаяДата = ОчереднаяДата + День;
	КонецЦикла;
	
	Возврат МассивДат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если НачалоПериода > ОкончаниеПериода Тогда
		ТекстСообщения = НСтр("ru = 'Окончание периода превышает начало периода планирования'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Окончание периода'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"ОкончаниеПериода", "Объект", Отказ);
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_ПланированиеЗатратНаЭксплуатацию.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ЗатратыРаботы, Движения, "АР_ПланируемыеЗатратыНаОбслуживаниеОбъектов", Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ЗатратыМатериалы, Движения, "АР_ПланируемыеЗатратыНаОбслуживаниеОбъектов", Отказ);
			
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры


#КонецЕсли
